kevinrefermat/AutonomousRover/mc9s12c128.h
/**************** interrupt vector table ****************/
#define VReserved63                     0x0000FF80
#define VReserved62                     0x0000FF82
#define VReserved61                     0x0000FF84
#define VReserved60                     0x0000FF86
#define VReserved59                     0x0000FF88
#define Vvreglvi                        0x0000FF8A
#define Vpwmesdn                        0x0000FF8C
#define Vportp                          0x0000FF8E
#define VReserved55                     0x0000FF90
#define VReserved54                     0x0000FF92
#define VReserved53                     0x0000FF94
#define VReserved52                     0x0000FF96
#define VReserved51                     0x0000FF98
#define VReserved50                     0x0000FF9A
#define VReserved49                     0x0000FF9C
#define VReserved48                     0x0000FF9E
#define VReserved47                     0x0000FFA0
#define VReserved46                     0x0000FFA2
#define VReserved45                     0x0000FFA4
#define VReserved44                     0x0000FFA6
#define VReserved43                     0x0000FFA8
#define VReserved42                     0x0000FFAA
#define VReserved41                     0x0000FFAC
#define VReserved40                     0x0000FFAE
#define Vcantx                          0x0000FFB0
#define Vcanrx                          0x0000FFB2
#define Vcanerr                         0x0000FFB4
#define Vcanwkup                        0x0000FFB6
#define Vflash                          0x0000FFB8
#define VReserved34                     0x0000FFBA
#define VReserved33                     0x0000FFBC
#define VReserved32                     0x0000FFBE
#define VReserved31                     0x0000FFC0
#define VReserved30                     0x0000FFC2
#define Vcrgscm                         0x0000FFC4
#define Vcrgplllck                      0x0000FFC6
#define VReserved27                     0x0000FFC8
#define VReserved26                     0x0000FFCA
#define VReserved25                     0x0000FFCC
#define Vportj                          0x0000FFCE
#define VReserved23                     0x0000FFD0
#define Vatd0                           0x0000FFD2
#define VReserved21                     0x0000FFD4
#define Vsci                            0x0000FFD6
#define Vspi                            0x0000FFD8
#define Vtimpaie                        0x0000FFDA
#define Vtimpaovf                       0x0000FFDC
#define Vtimovf                         0x0000FFDE
#define Vtimch7                         0x0000FFE0
#define Vtimch6                         0x0000FFE2
#define Vtimch5                         0x0000FFE4
#define Vtimch4                         0x0000FFE6
#define Vtimch3                         0x0000FFE8
#define Vtimch2                         0x0000FFEA
#define Vtimch1                         0x0000FFEC
#define Vtimch0                         0x0000FFEE
#define Vrti                            0x0000FFF0
#define Virq                            0x0000FFF2
#define Vxirq                           0x0000FFF4
#define Vswi                            0x0000FFF6
#define Vtrap                           0x0000FFF8
#define Vcop                            0x0000FFFA
#define Vclkmon                         0x0000FFFC
#define Vreset                          0x0000FFFE

/**************** registers I/O map ****************/

/*** PORTAB - Port AB Register; 0x00000000 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PORTA - Port A Register; 0x00000000 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Port A Bit 0 */
        byte BIT1        :1;                                       /* Port A Bit 1 */
        byte BIT2        :1;                                       /* Port A Bit 2 */
        byte BIT3        :1;                                       /* Port A Bit 3 */
        byte BIT4        :1;                                       /* Port A Bit 4 */
        byte BIT5        :1;                                       /* Port A Bit 5 */
        byte BIT6        :1;                                       /* Port A Bit 6 */
        byte BIT7        :1;                                       /* Port A Bit 7 */
      } Bits;
    } PORTASTR;
    #define PORTA                       _PORTAB.Overlap_STR.PORTASTR.Byte
    #define PORTA_BIT0                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT0
    #define PORTA_BIT1                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT1
    #define PORTA_BIT2                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT2
    #define PORTA_BIT3                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT3
    #define PORTA_BIT4                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT4
    #define PORTA_BIT5                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT5
    #define PORTA_BIT6                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT6
    #define PORTA_BIT7                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT7
    
    #define PORTA_BIT0_MASK             1
    #define PORTA_BIT1_MASK             2
    #define PORTA_BIT2_MASK             4
    #define PORTA_BIT3_MASK             8
    #define PORTA_BIT4_MASK             16
    #define PORTA_BIT5_MASK             32
    #define PORTA_BIT6_MASK             64
    #define PORTA_BIT7_MASK             128
    

    /*** PORTB - Port B Register; 0x00000001 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Port B Bit 0 */
        byte BIT1        :1;                                       /* Port B Bit 1 */
        byte BIT2        :1;                                       /* Port B Bit 2 */
        byte BIT3        :1;                                       /* Port B Bit 3 */
        byte BIT4        :1;                                       /* Port B Bit 4 */
        byte BIT5        :1;                                       /* Port B Bit 5 */
        byte BIT6        :1;                                       /* Port B Bit 6 */
        byte BIT7        :1;                                       /* Port B Bit 7 */
      } Bits;
    } PORTBSTR;
    #define PORTB                       _PORTAB.Overlap_STR.PORTBSTR.Byte
    #define PORTB_BIT0                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT0
    #define PORTB_BIT1                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT1
    #define PORTB_BIT2                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT2
    #define PORTB_BIT3                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT3
    #define PORTB_BIT4                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT4
    #define PORTB_BIT5                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT5
    #define PORTB_BIT6                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT6
    #define PORTB_BIT7                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT7
    
